spec/html_code_syntax_highlight_examples/code-block-exports-no-color.html
<p class="title">Support for :exports options from code blocks</p>
<p>According to the <a href="http://orgmode.org/manual/Exporting-code-blocks.html#Exporting-code-blocks">Org mode docs</a>, it is possible to customize whether
  the code block will be exported or not.</p>
<h1>About the <code>#+RESULTS:</code> block</h1>
<p>Using Org Babel features, it is possible to set <code>:results output</code>
  to a code block and render the results within a <code>#+RESULTS:</code> code block:</p>
<pre class="src" lang="ruby">
puts &quot;Hello world&quot;
</pre>
<pre class="example">
Hello world
</pre>
<p>One thing about the <code>#+RESULTS:</code> code blocks, is that they exist in several forms:</p>
<ol>
  <li>As an accumulated group of inline examples:
    <pre class="example">
like
this
etc...
    </pre>
  </li>
  <li>As an example code block.
    <pre class="src" lang="ruby">
10.times {|n| puts n }
    </pre>
    <pre class="example">
0
1
2
3
4
5
6
7
8
9
    </pre>
  </li>
  <li>Also, in case <code>:results output code</code> is used, the results would be a src block of the same language as the original one.
    <pre class="src" lang="ruby">
counter = 0
10.times { puts &quot;puts &#39;#{counter += 1}&#39;&quot; } # Displayed in first code block
puts counter # Displayed in second code block
    </pre>
    <pre class="src" lang="ruby">
puts &#39;1&#39;
puts &#39;2&#39;
puts &#39;3&#39;
puts &#39;4&#39;
puts &#39;5&#39;
puts &#39;6&#39;
puts &#39;7&#39;
puts &#39;8&#39;
puts &#39;9&#39;
puts &#39;10&#39;
10
    </pre>
    <pre class="example">
10
    </pre>
  </li>
</ol>
<h1>:exports code</h1>
<p>Only the code would be in the output,
  the same as when no option is set.</p>
<pre class="src" lang="js">
var message = &quot;Hello world!&quot;;

console.log(message);
</pre>
<pre class="example">
Hello world!
</pre>
<h1>:exports none</h1>
<p>This omits both the resulting block,
  and the code block itself.</p>
<pre class="example">
1
</pre>
<h1>:exports both</h1>
<pre class="src" lang="ruby">
Math::PI
</pre>
<pre class="example">
3.141592653589793
</pre>
<h1>:exports results</h1>
<p>This option can&#8217;t be completely supported by OrgRuby since
  we would have to eval the code block using :lang,
  so Org Babel features would have to be implemented as well.</p>
<p>But in case the resulting block is within the Org mode file,
  the code block will be omitted and only the results block
  would appear.</p>
<pre class="example">
3.141592653589793
</pre>
